x = 38
print('Дратути')
if x < 0:
    print('Меньше нуля')
print('Дотвидания')
#Примеры
a, b = 10, 5
if a > b:
    print('a > b')
if a > b and a > 0:
    print('успех')
if (a > b) and (a > 0 or b < 1000):
    print('успех')
if 5 < b and b < 10: #5 не меньше b, 5 = b
    print('успех')
#Можно сравнивать
if '34' > '120':
    print('верно')
if '123' > '12':
    print('верно')
if [1, 2] > [1, 1]:
    print('верно')
#что нельзя сравнивать - разные типы
if '6' > 5:
    print('успех')
if [5, 6] > 5:
    print('успех')
if '6' != 5:
    print('успех')
